 # TC 生成异常的空间分布

# 处理数据

In [1]:
pip install dbf

Collecting dbf
  Downloading dbf-0.99.3-py3-none-any.whl (107 kB)
     |████████████████████████████████| 107 kB 114 kB/s eta 0:00:01
Requirement already satisfied: aenum in /opt/conda/lib/python3.7/site-packages (from dbf) (2.2.6)
Installing collected packages: dbf
Successfully installed dbf-0.99.3
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install pandas dbfread

Requirement already satisfied: pandas in /opt/conda/lib/python3.7/site-packages (1.3.4)
Collecting dbfread
  Downloading dbfread-2.0.7-py2.py3-none-any.whl (20 kB)
Requirement already satisfied: pytz>=2017.3 in /opt/conda/lib/python3.7/site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.17.3; platform_machine != "aarch64" and platform_machine != "arm64" and python_version < "3.10" in /opt/conda/lib/python3.7/site-packages (from pandas) (1.21.2)
Requirement already satisfied: python-dateutil>=2.7.3 in /opt/conda/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: dbfread
Successfully installed dbfread-2.0.7
Note: you may need to restart the kernel to use updated packages.

In [1]:
import numpy as np  
import pandas as pd
import xarray as xr
from dbfread import DBF
import dbf
from scipy.stats import linregress
import matplotlib.pyplot as plt
from matplotlib import rcParams
import cartopy.crs as ccrs
import cartopy.feature as cfeature
from cartopy.mpl.gridliner import LONGITUDE_FORMATTER, LATITUDE_FORMATTER
import cartopy.mpl.ticker as cticker
from cartopy.io.shapereader import Reader
import cartopy.io.shapereader as shpreader
import math
from matplotlib import patches
from tqdm import tqdm
import os
import cmaps
from matplotlib.colors import ListedColormap

In [2]:
# 指定两个dbf文件路径
filename1 = "./dataset/SI.dbf"
filename2 = "./dataset/SP.dbf"

In [3]:
# 指定要读取的列名
columns = ['SID', 'year', 'BASIN', 'SUBBASIN', 'NAME', 'ISO_TIME', 'NATURE', 'LAT', 'LON', 'USA_ATCFID', 'DIST2LAND', 'USA_STATUS', 'USA_WIND']

In [4]:
# 读取dbf文件中指定列名的数据
data1 = []
for record in DBF(filename1):
    row = []
    for column in columns:
        row.append(record[column])
    data1.append(row)

data2 = []
for record in DBF(filename2):
    row = []
    for column in columns:
        row.append(record[column])
    data2.append(row)

In [5]:
# 将数据转换为DataFrame
df1 = pd.DataFrame(data1, columns=columns)  #168730row
df2 = pd.DataFrame(data2, columns=columns)  #75937row
df2

,SID,year,BASIN,SUBBASIN,NAME,ISO_TIME,NATURE,LAT,LON,USA_ATCFID,DIST2LAND,USA_STATUS,USA_WIND
0,1897005S10135,1897,SP,EA,NOT_NAMED,1897-01-04 12:00:00,NR,-10.10,135.30,,226,,NaN
1,1897005S10135,1897,SI,WA,NOT_NAMED,1897-01-04 15:00:00,NR,-10.28,134.90,,201,,NaN
2,1897005S10135,1897,SI,WA,NOT_NAMED,1897-01-04 18:00:00,NR,-10.44,134.52,,174,,NaN
3,1897005S10135,1897,SI,WA,NOT_NAMED,1897-01-04 21:00:00,NR,-10.59,134.18,,141,,NaN
4,1897005S10135,1897,SI,WA,NOT_NAMED,1897-01-05 00:00:00,NR,-10.70,133.90,,123,,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
75932,2023061S14162,2023,SP,MM,KEVIN,2023-03-06 06:00:00,NR,-30.80,193.00,SP162023,1525,,51.0
75933,2023061S14162,2023,SP,MM,KEVIN,2023-03-06 09:00:00,NR,-31.11,193.95,SP162023,1579,,48.0
75934,2023061S14162,2023,SP,MM,KEVIN,2023-03-06 12:00:00,NR,-31.40,194.70,SP162023,1627,,45.0
75935,2023061S14162,2023,SP,MM,KEVIN,2023-03-06 15:00:00,NR,-32.05,195.67,SP162023,1678,,42.0
75936,2023061S14162,2023,SP,MM,KEVIN,2023-03-06 18:00:00,NR,-32.90,196.80,SP162023,1729,,39.0

In [6]:
# 筛选TC，删除非TC以及陆地上的点
df1_s = df1[df1['USA_STATUS'].isin(['ST', 'TC', 'TD', 'TS', 'TY'])]
df1_s = df1_s[df1_s['DIST2LAND'] != 0]  #共18499行

df2_s = df2[df2['USA_STATUS'].isin(['ST', 'TC', 'TD', 'TS', 'TY'])]
df2_s = df2_s[df2_s['DIST2LAND'] != 0]  #共8355行

In [8]:
df2_s

,SID,year,BASIN,SUBBASIN,NAME,ISO_TIME,NATURE,LAT,LON,USA_ATCFID,DIST2LAND,USA_STATUS,USA_WIND
46124,1984361S08178,1984,SP,MM,NOT_NAMED,1984-12-26 06:00:00,TS,-8.52,178.29,SH071985,877,TD,25.0
46125,1984361S08178,1984,SP,MM,NOT_NAMED,1984-12-26 09:00:00,TS,-8.47,178.59,SH071985,872,TD,27.0
46126,1984361S08178,1984,SP,MM,NOT_NAMED,1984-12-26 12:00:00,TS,-8.40,178.86,SH071985,878,TD,30.0
46127,1984361S08178,1984,SP,MM,NOT_NAMED,1984-12-26 15:00:00,TS,-8.35,179.07,SH071985,876,TD,32.0
46128,1984361S08178,1984,SP,MM,NOT_NAMED,1984-12-26 18:00:00,TS,-8.38,179.23,SH071985,875,TS,35.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
75587,2022009S18174,2022,SP,MM,CODY,2022-01-12 21:00:00,TS,-25.27,175.44,SH052022,824,TS,47.0
75588,2022009S18174,2022,SP,MM,CODY,2022-01-13 00:00:00,TS,-25.60,175.80,SH052022,844,TS,45.0
75589,2022009S18174,2022,SP,MM,CODY,2022-01-13 03:00:00,TS,-25.87,176.18,SH052022,867,TS,47.0
75590,2022009S18174,2022,SP,MM,CODY,2022-01-13 06:00:00,TS,-26.10,176.50,SH052022,883,TS,50.0
75591,2022009S18174,2022,SP,MM,CODY,2022-01-13 09:00:00,TS,-26.36,176.68,SH052022,913,TS,50.0

In [16]:
# 筛选出年份在1980-2022年内的数据
df1_year = df1_s[(df1_s['year'] >= 1980) & (df1_s['year'] <= 2022)]

# 筛选出USA_WIND大于等于35的数据
df1_w = df1_year[df1_year['USA_WIND'] >= 35]

# 检查SID是否有重复，若有重复则保留'USA_WIND'列最接近35的那一行数据
df1_SID = df1_w.sort_values(by=['SID', 'USA_WIND'])  #按照 SID 和 USA_WIND 列进行升序排序，即先按照 SID 排序，如果 SID 相同，则按照 USA_WIND 排序。
df1_SID.drop_duplicates(subset=['SID'], keep='first', inplace=True)  #若SID重复，保留这些行的第一个

In [17]:
# df2筛选同理
df2_year = df2_s[(df2_s['year'] >= 1980) & (df2_s['year'] <= 2022)]
df2_w = df2_year[df2_year['USA_WIND'] >= 35]
df2_SID = df2_w.sort_values(by=['SID', 'USA_WIND'])  
df2_SID.drop_duplicates(subset=['SID'], keep='first', inplace=True)

In [18]:
df2_SID  #共200个TC

,SID,year,BASIN,SUBBASIN,NAME,ISO_TIME,NATURE,LAT,LON,USA_ATCFID,DIST2LAND,USA_STATUS,USA_WIND
46128,1984361S08178,1984,SP,MM,NOT_NAMED,1984-12-26 18:00:00,TS,-8.38,179.23,SH071985,875,TS,35.0
52281,1992064S10184,1992,SP,MM,FRAN,1992-03-06 00:00:00,TS,-13.50,182.10,SH251992,383,TS,35.0
60637,2000055S23227,2000,SP,MM,KIM,2000-02-24 12:00:00,TS,-23.25,-135.25,SH132000,4028,TS,35.0
61031,2000089S20168,2000,SP,EA,VAUGHAN,2000-04-03 00:00:00,TS,-14.77,159.54,SH232000,512,TS,35.0
61126,2000104S17182,2000,SP,MM,NEIL,2000-04-16 12:00:00,TS,-22.60,179.45,SH252000,499,TS,35.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
75131,2021029S16171,2021,SP,MM,ANA,2021-01-29 12:00:00,TS,-15.50,174.50,SH152021,388,TS,35.0
75188,2021038S14178,2021,SP,MM,NOT_NAMED,2021-02-09 12:00:00,TS,-21.42,181.30,SH202021,458,TS,35.0
75221,2021058S16149,2021,SP,EA,NIRAN,2021-02-28 12:00:00,TS,-17.15,148.20,SH232021,225,TS,35.0
75292,2021099S15159,2021,SP,MM,NOT_NAMED,2021-04-10 18:00:00,TS,-23.00,166.60,SH282021,67,TS,35.0
75564,2022009S18174,2022,SP,MM,CODY,2022-01-10 00:00:00,TS,-20.10,176.41,SP052022,242,TD,39.0

In [19]:
# 按照 'year'，'LAT' 和 'LON' 进行分组，并统计每个组的大小
df1_count = df1_SID.groupby(['year', 'LAT', 'LON']).size().reset_index(name='tc')
df2_count = df2_SID.groupby(['year', 'LAT', 'LON']).size().reset_index(name='tc')

In [20]:
# 将两个 DataFrame 拼接在一起
df_concat = pd.concat([df1_count, df2_count], axis=0)
df_concat

     year    LAT     LON  tc
0    2000 -18.48  116.35   1
1    2000 -16.57   74.03   1
2    2000 -15.25   91.65   1
3    2000 -14.97   80.27   1
4    2000 -14.35  123.29   1
..    ...    ...     ...  ..
195  2021 -15.50  174.50   1
196  2021 -14.62  146.40   1
197  2021 -14.18  175.90   1
198  2021 -13.95  152.35   1
199  2022 -20.10  176.41   1

[547 rows x 4 columns]

In [23]:
# 可保存
#g1 = df1_count.to_csv('TC_South_indian.csv', index = False, header=False,na_rep='NaN')
#g2 = df2_count.to_csv('TC_South_Pacific.csv', index = False, header=False,na_rep='NaN')

In [21]:
# 创建 'lat' 和 'lon' 的坐标数组
#lat = np.arange(-40,0.5,2.5)  # lat 从 0° 到 40°S，步长 2.5°
lat = np.arange(0, -40.5, -2.5)  # lat 从 0° 到 40°S，步长 2.5°
lon = np.arange(0, 360, 2.5)  # lon 从 0 到 360，步长 2.5°

In [22]:
lat

array([  0. ,  -2.5,  -5. ,  -7.5, -10. , -12.5, -15. , -17.5, -20. ,
       -22.5, -25. , -27.5, -30. , -32.5, -35. , -37.5, -40. ])

In [23]:
# 创建 'tc' 变量，并将其写入 DataArray 对象
tc = xr.DataArray(
    data=np.zeros((len(np.arange(2000, 2023)), len(lat), len(lon))),
    dims=('year', 'lat', 'lon'),
    coords={'year': np.arange(2000, 2023), 'lat': lat, 'lon': lon},
)

In [26]:
# 将每个格点每年生成的台风数量写入 'tc' 变量
# 将 DataFrame 表中的数据写入 'tc' 变量中相应的位置
for _, row in df_concat.iterrows():
    year, lat, lon, count = row.values
    print(_, row, year, lat, lon, count)
    year = int(year)  # 将 year 转换为整数类型
    lat_idx = int(round(-lat / 2.5))  # 计算 lat 在 'tc' 中的索引
    lon_idx = int(round(lon / 2.5))  # 计算 lon 在 'tc' 中的索引
    tc[year-2000, lat_idx, lon_idx-1] = count

0 year    2000.00
LAT      -18.48
LON      116.35
tc         1.00
Name: 0, dtype: float64 2000.0 -18.48 116.35 1.0
1 year    2000.00
LAT      -16.57
LON       74.03
tc         1.00
Name: 1, dtype: float64 2000.0 -16.57 74.03 1.0
2 year    2000.00
LAT      -15.25
LON       91.65
tc         1.00
Name: 2, dtype: float64 2000.0 -15.25 91.65 1.0
3 year    2000.00
LAT      -14.97
LON       80.27
tc         1.00
Name: 3, dtype: float64 2000.0 -14.97 80.27 1.0
4 year    2000.00
LAT      -14.35
LON      123.29
tc         1.00
Name: 4, dtype: float64 2000.0 -14.35 123.29 1.0
5 year    2000.00
LAT      -14.04
LON      113.07
tc         1.00
Name: 5, dtype: float64 2000.0 -14.04 113.07 1.0
6 year    2000.00
LAT      -12.87
LON       56.53
tc         1.00
Name: 6, dtype: float64 2000.0 -12.87 56.53 1.0
7 year    2000.00
LAT      -12.53
LON      106.03
tc         1.00
Name: 7, dtype: float64 2000.0 -12.53 106.03 1.0
8 year    2000.0
LAT      -10.5
LON       79.4
tc         1.0
Name: 8, dtype: float64 2000.0 -10.5 79.4 1.0
9 year    2000.0
LAT       -6.2
LON       77.7
tc         1.0
Name: 9, dtype: float64 2000.0 -6.2 77.7 1.0
10 year    2001.00
LAT      -25.90
LON       39.03
tc         1.00
Name: 10, dtype: float64 2001.0 -25.9 39.03 1.0
11 year    2001.00
LAT      -18.27
LON       40.17
tc         1.00
Name: 11, dtype: float64 2001.0 -18.27 40.17 1.0
12 year    2001.00
LAT      -16.90
LON      120.38
tc         1.00
Name: 12, dtype: float64 2001.0 -16.9 120.38 1.0
13 year    2001.00
LAT      -16.13
LON      140.33
tc         1.00
Name: 13, dtype: float64 2001.0 -16.13 140.33 1.0
14 year    2001.00
LAT      -14.87
LON       82.93
tc         1.00
Name: 14, dtype: float64 2001.0 -14.87 82.93 1.0
15 year    2001.00
LAT      -14.66
LON      111.84
tc         1.00
Name: 15, dtype: float64 2001.0 -14.66 111.84 1.0
16 year    2001.00
LAT      -14.47
LON       84.10
tc         1.00
Name: 16, dtype: float64 2001.0 -14.47 84.1 1.0
17 year    2001.00
LAT      -14.13
LON      136.20
tc         1.00
Name: 17, dtype: float64 2001.0 -14.13 136.2 1.0
18 year    2001.0
LAT      -11.7
LON       75.0
tc         1.0
Name: 18, dtype: float64 2001.0 -11.7 75.0 1.0
19 year    2001.0
LAT      -11.4
LON       82.8
tc         1.0
Name: 19, dtype: float64 2001.0 -11.4 82.8 1.0
20 year    2001.00
LAT      -11.17
LON       63.03
tc         1.00
Name: 20, dtype: float64 2001.0 -11.17 63.03 1.0
21 year    2001.00
LAT      -11.13
LON       61.17
tc         1.00
Name: 21, dtype: float64 2001.0 -11.13 61.17 1.0
22 year    2001.0
LAT      -11.0
LON       83.0
tc         1.0
Name: 22, dtype: float64 2001.0 -11.0 83.0 1.0
23 year    2001.00
LAT       -9.86
LON      104.63
tc         1.00
Name: 23, dtype: float64 2001.0 -9.86 104.63 1.0
24 year    2001.00
LAT       -9.17
LON      133.57
tc         1.00
Name: 24, dtype: float64 2001.0 -9.17 133.57 1.0
25 year    2001.00
LAT       -8.53
LON       92.97
tc         1.00
Name: 25, dtype: float64 2001.0 -8.53 92.97 1.0
26 year    2001.00
LAT       -7.97
LON       94.38
tc         1.00
Name: 26, dtype: float64 2001.0 -7.97 94.38 1.0
27 year    2001.0
LAT       -6.7
LON      129.3
tc         1.0
Name: 27, dtype: float64 2001.0 -6.7 129.3 1.0
28 year    2002.00
LAT      -29.38
LON       53.04
tc         1.00
Name: 28, dtype: float64 2002.0 -29.38 53.04 1.0
29 year    2002.00
LAT      -20.07
LON       40.33
tc         1.00
Name: 29, dtype: float64 2002.0 -20.07 40.33 1.0
30 year    2002.00
LAT      -16.28
LON       42.36
tc         1.00
Name: 30, dtype: float64 2002.0 -16.28 42.36 1.0
31 year    2002.00
LAT      -15.49
LON      121.32
tc         1.00
Name: 31, dtype: float64 2002.0 -15.49 121.32 1.0
32 year    2002.00
LAT      -15.13
LON       52.23
tc         1.00
Name: 32, dtype: float64 2002.0 -15.13 52.23 1.0
33 year    2002.00
LAT      -14.13
LON       84.47
tc         1.00
Name: 33, dtype: float64 2002.0 -14.13 84.47 1.0
34 year    2002.00
LAT      -13.37
LON       88.73
tc         1.00
Name: 34, dtype: float64 2002.0 -13.37 88.73 1.0
35 year    2002.00
LAT      -12.18
LON       97.95
tc         1.00
Name: 35, dtype: float64 2002.0 -12.18 97.95 1.0
36 year    2002.00
LAT      -11.23
LON       63.97
tc         1.00
Name: 36, dtype: float64 2002.0 -11.23 63.97 1.0
37 year    2002.00
LAT      -11.10
LON       66.53
tc         1.00
Name: 37, dtype: float64 2002.0 -11.1 66.53 1.0
38 year    2002.00
LAT      -10.87
LON       75.33
tc         1.00
Name: 38, dtype: float64 2002.0 -10.87 75.33 1.0
39 year    2002.00
LAT      -10.13
LON      123.27
tc         1.00
Name: 39, dtype: float64 2002.0 -10.13 123.27 1.0
40 year    2002.0
LAT       -9.1
LON       59.5
tc         1.0
Name: 40, dtype: float64 2002.0 -9.1 59.5 1.0
41 year    2002.00
LAT       -8.93
LON       65.70
tc         1.00
Name: 41, dtype: float64 2002.0 -8.93 65.7 1.0
42 year    2002.00
LAT       -8.80
LON       76.03
tc         1.00
Name: 42, dtype: float64 2002.0 -8.8 76.03 1.0
43 year    2002.00
LAT       -6.77
LON       96.83
tc         1.00
Name: 43, dtype: float64 2002.0 -6.77 96.83 1.0
44 year    2002.00
LAT       -4.03
LON       58.07
tc         1.00
Name: 44, dtype: float64 2002.0 -4.03 58.07 1.0
45 year    2003.00
LAT      -21.53
LON       39.83
tc         1.00
Name: 45, dtype: float64 2003.0 -21.53 39.83 1.0
46 year    2003.00
LAT      -18.76
LON      120.86
tc         1.00
Name: 46, dtype: float64 2003.0 -18.76 120.86 1.0
47 year    2003.00
LAT      -15.97
LON       82.17
tc         1.00
Name: 47, dtype: float64 2003.0 -15.97 82.17 1.0
48 year    2003.00
LAT      -14.93
LON      113.50
tc         1.00
Name: 48, dtype: float64 2003.0 -14.93 113.5 1.0
49 year    2003.0
LAT      -14.9
LON       74.4
tc         1.0
Name: 49, dtype: float64 2003.0 -14.9 74.4 1.0
50 year    2003.00
LAT      -14.73
LON       64.27
tc         1.00
Name: 50, dtype: float64 2003.0 -14.73 64.27 1.0
51 year    2003.00
LAT      -13.63
LON       63.53
tc         1.00
Name: 51, dtype: float64 2003.0 -13.63 63.53 1.0
52 year    2003.00
LAT      -13.17
LON       55.83
tc         1.00
Name: 52, dtype: float64 2003.0 -13.17 55.83 1.0
53 year    2003.00
LAT      -12.80
LON       58.63
tc         1.00
Name: 53, dtype: float64 2003.0 -12.8 58.63 1.0
54 year    2003.00
LAT      -11.83
LON      111.43
tc         1.00
Name: 54, dtype: float64 2003.0 -11.83 111.43 1.0
55 year    2003.00
LAT      -11.67
LON       62.73
tc         1.00
Name: 55, dtype: float64 2003.0 -11.67 62.73 1.0
56 year    2003.0
LAT      -11.5
LON       70.4
tc         1.0
Name: 56, dtype: float64 2003.0 -11.5 70.4 1.0
57 year    2003.0
LAT      -11.4
LON       77.9
tc         1.0
Name: 57, dtype: float64 2003.0 -11.4 77.9 1.0
58 year    2003.00
LAT      -10.93
LON      130.73
tc         1.00
Name: 58, dtype: float64 2003.0 -10.93 130.73 1.0
59 year    2003.00
LAT      -10.18
LON      120.01
tc         1.00
Name: 59, dtype: float64 2003.0 -10.18 120.01 1.0
60 year    2003.00
LAT       -9.87
LON      135.27
tc         1.00
Name: 60, dtype: float64 2003.0 -9.87 135.27 1.0
61 year    2003.00
LAT       -7.73
LON       95.50
tc         1.00
Name: 61, dtype: float64 2003.0 -7.73 95.5 1.0
62 year    2003.00
LAT       -7.20
LON       75.87
tc         1.00
Name: 62, dtype: float64 2003.0 -7.2 75.87 1.0
63 year    2003.00
LAT       -4.43
LON       65.07
tc         1.00
Name: 63, dtype: float64 2003.0 -4.43 65.07 1.0
64 year    2004.00
LAT      -19.17
LON      119.97
tc         1.00
Name: 64, dtype: float64 2004.0 -19.17 119.97 1.0
65 year    2004.00
LAT      -18.43
LON       43.47
tc         1.00
Name: 65, dtype: float64 2004.0 -18.43 43.47 1.0
66 year    2004.00
LAT      -16.70
LON      139.85
tc         1.00
Name: 66, dtype: float64 2004.0 -16.7 139.85 1.0
67 year    2004.0
LAT      -16.5
LON      120.2
tc         1.0
Name: 67, dtype: float64 2004.0 -16.5 120.2 1.0
68 year    2004.00
LAT      -14.87
LON      121.23
tc         1.00
Name: 68, dtype: float64 2004.0 -14.87 121.23 1.0
69 year    2004.00
LAT      -14.45
LON       97.72
tc         1.00
Name: 69, dtype: float64 2004.0 -14.45 97.72 1.0
70 year    2004.00
LAT      -13.80
LON       65.93
tc         1.00
Name: 70, dtype: float64 2004.0 -13.8 65.93 1.0
71 year    2004.00
LAT      -13.22
LON       90.78
tc         1.00
Name: 71, dtype: float64 2004.0 -13.22 90.78 1.0
72 year    2004.00
LAT      -11.90
LON      127.67
tc         1.00
Name: 72, dtype: float64 2004.0 -11.9 127.67 1.0
73 year    2004.00
LAT      -11.43
LON       64.67
tc         1.00
Name: 73, dtype: float64 2004.0 -11.43 64.67 1.0
74 year    2004.0
LAT      -11.3
LON      109.5
tc         1.0
Name: 74, dtype: float64 2004.0 -11.3 109.5 1.0
75 year    2004.00
LAT       -9.87
LON       79.13
tc         1.00
Name: 75, dtype: float64 2004.0 -9.87 79.13 1.0
76 year    2004.00
LAT       -9.57
LON       86.13
tc         1.00
Name: 76, dtype: float64 2004.0 -9.57 86.13 1.0
77 year    2004.0
LAT       -9.1
LON       52.2
tc         1.0
Name: 77, dtype: float64 2004.0 -9.1 52.2 1.0
78 year    2004.00
LAT       -8.44
LON       76.48
tc         1.00
Name: 78, dtype: float64 2004.0 -8.44 76.48 1.0
79 year    2004.00
LAT       -8.23
LON       92.60
tc         1.00
Name: 79, dtype: float64 2004.0 -8.23 92.6 1.0
80 year    2004.00
LAT       -8.13
LON       78.63
tc         1.00
Name: 80, dtype: float64 2004.0 -8.13 78.63 1.0
81 year    2004.00
LAT       -7.30
LON       90.67
tc         1.00
Name: 81, dtype: float64 2004.0 -7.3 90.67 1.0
82 year    2005.00
LAT      -22.27
LON       58.47
tc         1.00
Name: 82, dtype: float64 2005.0 -22.27 58.47 1.0
83 year    2005.00
LAT      -16.43
LON      116.30
tc         1.00
Name: 83, dtype: float64 2005.0 -16.43 116.3 1.0
84 year    2005.00
LAT      -16.00
LON       70.07
tc         1.00
Name: 84, dtype: float64 2005.0 -16.0 70.07 1.0
85 year    2005.00
LAT      -15.57
LON      109.47
tc         1.00
Name: 85, dtype: float64 2005.0 -15.57 109.47 1.0
86 year    2005.0
LAT      -15.3
LON       59.2
tc         1.0
Name: 86, dtype: float64 2005.0 -15.3 59.2 1.0
87 year    2005.0
LAT      -14.6
LON      117.2
tc         1.0
Name: 87, dtype: float64 2005.0 -14.6 117.2 1.0
88 year    2005.00
LAT      -13.97
LON      117.37
tc         1.00
Name: 88, dtype: float64 2005.0 -13.97 117.37 1.0
89 year    2005.00
LAT      -13.77
LON      100.33
tc         1.00
Name: 89, dtype: float64 2005.0 -13.77 100.33 1.0
90 year    2005.00
LAT      -13.40
LON       93.36
tc         1.00
Name: 90, dtype: float64 2005.0 -13.4 93.36 1.0
91 year    2005.00
LAT      -12.81
LON      148.06
tc         1.00
Name: 91, dtype: float64 2005.0 -12.81 148.06 1.0
92 year    2005.0
LAT      -12.6
LON       85.0
tc         1.0
Name: 92, dtype: float64 2005.0 -12.6 85.0 1.0
93 year    2005.0
LAT      -11.1
LON       81.9
tc         1.0
Name: 93, dtype: float64 2005.0 -11.1 81.9 1.0
94 year    2005.0
LAT      -10.8
LON       93.6
tc         1.0
Name: 94, dtype: float64 2005.0 -10.8 93.6 1.0
95 year    2005.00
LAT      -10.53
LON       50.40
tc         1.00
Name: 95, dtype: float64 2005.0 -10.53 50.4 1.0
96 year    2005.00
LAT      -10.50
LON       83.63
tc         1.00
Name: 96, dtype: float64 2005.0 -10.5 83.63 1.0
97 year    2005.00
LAT       -7.24
LON       93.94
tc         1.00
Name: 97, dtype: float64 2005.0 -7.24 93.94 1.0
98 year    2006.00
LAT      -19.47
LON      115.37
tc         1.00
Name: 98, dtype: float64 2006.0 -19.47 115.37 1.0
99 year    2006.00
LAT      -18.87
LON       51.20
tc         1.00
Name: 99, dtype: float64 2006.0 -18.87 51.2 1.0
100 year    2006.0
LAT      -17.9
LON       55.3
tc         1.0
Name: 100, dtype: float64 2006.0 -17.9 55.3 1.0
101 year    2006.00
LAT      -17.80
LON       56.63
tc         1.00
Name: 101, dtype: float64 2006.0 -17.8 56.63 1.0
102 year    2006.00
LAT      -16.46
LON      116.43
tc         1.00
Name: 102, dtype: float64 2006.0 -16.46 116.43 1.0
103 year    2006.00
LAT      -16.17
LON      122.60
tc         1.00
Name: 103, dtype: float64 2006.0 -16.17 122.6 1.0
104 year    2006.00
LAT      -15.33
LON      121.80
tc         1.00
Name: 104, dtype: float64 2006.0 -15.33 121.8 1.0
105 year    2006.00
LAT      -14.83
LON      125.03
tc         1.00
Name: 105, dtype: float64 2006.0 -14.83 125.03 1.0
106 year    2006.0
LAT      -14.0
LON       54.9
tc         1.0
Name: 106, dtype: float64 2006.0 -14.0 54.9 1.0
107 year    2006.00
LAT      -12.73
LON       90.80
tc         1.00
Name: 107, dtype: float64 2006.0 -12.73 90.8 1.0
108 year    2006.00
LAT      -12.43
LON      115.87
tc         1.00
Name: 108, dtype: float64 2006.0 -12.43 115.87 1.0
109 year    2006.00
LAT      -12.20
LON      149.98
tc         1.00
Name: 109, dtype: float64 2006.0 -12.2 149.98 1.0
110 year    2006.00
LAT      -10.83
LON       41.73
tc         1.00
Name: 110, dtype: float64 2006.0 -10.83 41.73 1.0
111 year    2006.00
LAT      -10.77
LON       64.40
tc         1.00
Name: 111, dtype: float64 2006.0 -10.77 64.4 1.0
112 year    2006.00
LAT      -10.33
LON       81.67
tc         1.00
Name: 112, dtype: float64 2006.0 -10.33 81.67 1.0
113 year    2007.00
LAT      -18.45
LON       41.25
tc         1.00
Name: 113, dtype: float64 2007.0 -18.45 41.25 1.0
114 year    2007.00
LAT      -16.57
LON      116.73
tc         1.00
Name: 114, dtype: float64 2007.0 -16.57 116.73 1.0
115 year    2007.00
LAT      -16.13
LON       65.90
tc         1.00
Name: 115, dtype: float64 2007.0 -16.13 65.9 1.0
116 year    2007.00
LAT      -15.33
LON      119.27
tc         1.00
Name: 116, dtype: float64 2007.0 -15.33 119.27 1.0
117 year    2007.00
LAT      -15.20
LON       53.97
tc         1.00
Name: 117, dtype: float64 2007.0 -15.2 53.97 1.0
118 year    2007.00
LAT      -14.70
LON      117.95
tc         1.00
Name: 118, dtype: float64 2007.0 -14.7 117.95 1.0
119 year    2007.00
LAT      -14.33
LON       70.87
tc         1.00
Name: 119, dtype: float64 2007.0 -14.33 70.87 1.0
120 year    2007.0
LAT      -14.1
LON      129.4
tc         1.0
Name: 120, dtype: float64 2007.0 -14.1 129.4 1.0
121 year    2007.00
LAT      -13.55
LON       70.10
tc         1.00

Name: 121, dtype: float64 2007.0 -13.55 70.1 1.0
122 year    2007.00
LAT      -13.30
LON       58.47
tc         1.00
Name: 122, dtype: float64 2007.0 -13.3 58.47 1.0
123 year    2007.00
LAT      -13.20
LON       84.55
tc         1.00
Name: 123, dtype: float64 2007.0 -13.2 84.55 1.0
124 year    2007.00
LAT      -13.17
LON       67.53
tc         1.00
Name: 124, dtype: float64 2007.0 -13.17 67.53 1.0
125 year    2007.00
LAT      -12.73
LON      108.30
tc         1.00
Name: 125, dtype: float64 2007.0 -12.73 108.3 1.0
126 year    2007.00
LAT      -11.63
LON       83.83
tc         1.00
Name: 126, dtype: float64 2007.0 -11.63 83.83 1.0
127 year    2007.0
LAT      -10.4
LON       90.5
tc         1.0
Name: 127, dtype: float64 2007.0 -10.4 90.5 1.0
128 year    2007.00
LAT      -10.03
LON       67.33
tc         1.00
Name: 128, dtype: float64 2007.0 -10.03 67.33 1.0
129 year    2007.00
LAT       -8.83
LON       91.51
tc         1.00
Name: 129, dtype: float64 2007.0 -8.83 91.51 1.0
130 year    2007.00
LAT       -8.04
LON       76.09
tc         1.00
Name: 130, dtype: float64 2007.0 -8.04 76.09 1.0
131 year    2008.0
LAT      -16.1
LON      105.1
tc         1.0
Name: 131, dtype: float64 2008.0 -16.1 105.1 1.0
132 year    2008.00
LAT      -15.55
LON       59.80
tc         1.00
Name: 132, dtype: float64 2008.0 -15.55 59.8 1.0
133 year    2008.00
LAT      -15.45
LON      123.35
tc         1.00
Name: 133, dtype: float64 2008.0 -15.45 123.35 1.0
134 year    2008.00
LAT      -14.84
LON      120.41
tc         1.00
Name: 134, dtype: float64 2008.0 -14.84 120.41 1.0
135 year    2008.0
LAT      -14.7
LON      128.8
tc         1.0
Name: 135, dtype: float64 2008.0 -14.7 128.8 1.0
136 year    2008.00
LAT      -14.15
LON      127.78
tc         1.00
Name: 136, dtype: float64 2008.0 -14.15 127.78 1.0
137 year    2008.00
LAT      -13.85
LON       44.60
tc         1.00
Name: 137, dtype: float64 2008.0 -13.85 44.6 1.0
138 year    2008.00
LAT      -13.15
LON       80.30
tc         1.00
Name: 138, dtype: float64 2008.0 -13.15 80.3 1.0
139 year    2008.00
LAT      -13.11
LON      103.33
tc         1.00
Name: 139, dtype: float64 2008.0 -13.11 103.33 1.0
140 year    2008.00
LAT      -12.65
LON       62.55
tc         1.00
Name: 140, dtype: float64 2008.0 -12.65 62.55 1.0
141 year    2008.00
LAT      -12.50
LON       59.75
tc         1.00
Name: 141, dtype: float64 2008.0 -12.5 59.75 1.0
142 year    2008.00
LAT      -11.89
LON       88.06
tc         1.00
Name: 142, dtype: float64 2008.0 -11.89 88.06 1.0
143 year    2008.00
LAT      -11.70
LON       54.45
tc         1.00
Name: 143, dtype: float64 2008.0 -11.7 54.45 1.0
144 year    2008.00
LAT      -10.85
LON       96.65
tc         1.00
Name: 144, dtype: float64 2008.0 -10.85 96.65 1.0
145 year    2008.00
LAT      -10.15
LON       67.05
tc         1.00
Name: 145, dtype: float64 2008.0 -10.15 67.05 1.0
146 year    2008.00
LAT       -9.80
LON      103.25
tc         1.00
Name: 146, dtype: float64 2008.0 -9.8 103.25 1.0
147 year    2008.00
LAT       -9.50
LON       80.85
tc         1.00
Name: 147, dtype: float64 2008.0 -9.5 80.85 1.0
148 year    2008.00
LAT       -8.30
LON       93.71
tc         1.00
Name: 148, dtype: float64 2008.0 -8.3 93.71 1.0
149 year    2008.00
LAT       -5.55
LON       68.95
tc         1.00
Name: 149, dtype: float64 2008.0 -5.55 68.95 1.0
150 year    2009.00
LAT      -21.65
LON       41.75
tc         1.00
Name: 150, dtype: float64 2009.0 -21.65 41.75 1.0
151 year    2009.00
LAT      -21.56
LON       41.35
tc         1.00
Name: 151, dtype: float64 2009.0 -21.56 41.35 1.0
152 year    2009.00
LAT      -18.90
LON      116.35
tc         1.00
Name: 152, dtype: float64 2009.0 -18.9 116.35 1.0
153 year    2009.0
LAT      -18.4
LON       86.3
tc         1.0
Name: 153, dtype: float64 2009.0 -18.4 86.3 1.0
154 year    2009.00
LAT      -17.45
LON       67.40
tc         1.00
Name: 154, dtype: float64 2009.0 -17.45 67.4 1.0
155 year    2009.00
LAT      -16.55
LON       51.10
tc         1.00
Name: 155, dtype: float64 2009.0 -16.55 51.1 1.0
156 year    2009.0
LAT      -16.1
LON       66.4
tc         1.0
Name: 156, dtype: float64 2009.0 -16.1 66.4 1.0
157 year    2009.00
LAT      -16.05
LON      113.41
tc         1.00
Name: 157, dtype: float64 2009.0 -16.05 113.41 1.0
158 year    2009.00
LAT      -14.55
LON       77.85
tc         1.00
Name: 158, dtype: float64 2009.0 -14.55 77.85 1.0
159 year    2009.00
LAT      -13.55
LON      105.55
tc         1.00
Name: 159, dtype: float64 2009.0 -13.55 105.55 1.0
160 year    2009.00
LAT      -13.20
LON      114.75
tc         1.00
Name: 160, dtype: float64 2009.0 -13.2 114.75 1.0
161 year    2009.00
LAT      -12.55
LON      128.60
tc         1.00
Name: 161, dtype: float64 2009.0 -12.55 128.6 1.0
162 year    2009.0
LAT      -12.3
LON       56.0
tc         1.0
Name: 162, dtype: float64 2009.0 -12.3 56.0 1.0
163 year    2009.00
LAT      -12.27
LON       71.02
tc         1.00
Name: 163, dtype: float64 2009.0 -12.27 71.02 1.0
164 year    2009.00
LAT      -11.10
LON       62.45
tc         1.00
Name: 164, dtype: float64 2009.0 -11.1 62.45 1.0
165 year    2009.00
LAT       -8.65
LON       81.70
tc         1.00
Name: 165, dtype: float64 2009.0 -8.65 81.7 1.0
166 year    2009.00
LAT       -8.40
LON       54.25
tc         1.00
Name: 166, dtype: float64 2009.0 -8.4 54.25 1.0
167 year    2009.00
LAT       -7.20
LON      134.55
tc         1.00
Name: 167, dtype: float64 2009.0 -7.2 134.55 1.0
168 year    2010.00
LAT      -20.45
LON       49.85
tc         1.00
Name: 168, dtype: float64 2010.0 -20.45 49.85 1.0
169 year    2010.00
LAT      -20.38
LON       42.60
tc         1.00
Name: 169, dtype: float64 2010.0 -20.38 42.6 1.0
170 year    2010.0
LAT      -20.1
LON       59.5
tc         1.0
Name: 170, dtype: float64 2010.0 -20.1 59.5 1.0
171 year    2010.00
LAT      -13.22
LON      136.57
tc         1.00
Name: 171, dtype: float64 2010.0 -13.22 136.57 1.0
172 year    2010.00
LAT      -12.75
LON      115.20
tc         1.00
Name: 172, dtype: float64 2010.0 -12.75 115.2 1.0
173 year    2010.00
LAT      -12.55
LON       83.60
tc         1.00
Name: 173, dtype: float64 2010.0 -12.55 83.6 1.0
174 year    2010.00
LAT      -12.50
LON      122.15
tc         1.00
Name: 174, dtype: float64 2010.0 -12.5 122.15 1.0
175 year    2010.00
LAT      -12.07
LON       85.97
tc         1.00
Name: 175, dtype: float64 2010.0 -12.07 85.97 1.0
176 year    2010.00
LAT      -11.75
LON       89.30
tc         1.00
Name: 176, dtype: float64 2010.0 -11.75 89.3 1.0
177 year    2010.0
LAT      -11.3
LON       59.8
tc         1.0
Name: 177, dtype: float64 2010.0 -11.3 59.8 1.0
178 year    2010.0
LAT      -11.1
LON       92.5
tc         1.0
Name: 178, dtype: float64 2010.0 -11.1 92.5 1.0
179 year    2010.0
LAT      -10.9
LON       86.4
tc         1.0
Name: 179, dtype: float64 2010.0 -10.9 86.4 1.0
180 year    2010.00
LAT       -8.05
LON       95.90
tc         1.00
Name: 180, dtype: float64 2010.0 -8.05 95.9 1.0
181 year    2011.0
LAT      -20.9
LON      100.3
tc         1.0
Name: 181, dtype: float64 2011.0 -20.9 100.3 1.0
182 year    2011.00
LAT      -19.11
LON      111.67
tc         1.00
Name: 182, dtype: float64 2011.0 -19.11 111.67 1.0
183 year    2011.0
LAT      -17.2
LON      121.8
tc         1.0
Name: 183, dtype: float64 2011.0 -17.2 121.8 1.0
184 year    2011.0
LAT      -16.9
LON       69.5
tc         1.0
Name: 184, dtype: float64 2011.0 -16.9 69.5 1.0
185 year    2011.00
LAT      -15.00
LON      107.55
tc         1.00
Name: 185, dtype: float64 2011.0 -15.0 107.55 1.0
186 year    2011.0
LAT      -14.8
LON       76.4
tc         1.0
Name: 186, dtype: float64 2011.0 -14.8 76.4 1.0
187 year    2011.0
LAT      -13.7
LON       55.2
tc         1.0
Name: 187, dtype: float64 2011.0 -13.7 55.2 1.0
188 year    2011.00
LAT      -13.50
LON      127.65
tc         1.00
Name: 188, dtype: float64 2011.0 -13.5 127.65 1.0
189 year    2011.00
LAT      -13.30
LON      170.65
tc         1.00
Name: 189, dtype: float64 2011.0 -13.3 170.65 1.0
190 year    2011.00
LAT      -12.85
LON      126.25
tc         1.00
Name: 190, dtype: float64 2011.0 -12.85 126.25 1.0
191 year    2011.00
LAT      -12.45
LON       87.95
tc         1.00
Name: 191, dtype: float64 2011.0 -12.45 87.95 1.0
192 year    2011.00
LAT      -12.43
LON      130.68
tc         1.00
Name: 192, dtype: float64 2011.0 -12.43 130.68 1.0
193 year    2011.00
LAT      -12.27
LON       88.87
tc         1.00
Name: 193, dtype: float64 2011.0 -12.27 88.87 1.0
194 year    2011.00
LAT      -10.35
LON      132.70
tc         1.00
Name: 194, dtype: float64 2011.0 -10.35 132.7 1.0
195 year    2012.00
LAT      -19.05
LON       42.80
tc         1.00
Name: 195, dtype: float64 2012.0 -19.05 42.8 1.0
196 year    2012.00
LAT      -18.66
LON      114.69
tc         1.00
Name: 196, dtype: float64 2012.0 -18.66 114.69 1.0
197 year    2012.0
LAT      -17.6
LON       40.7
tc         1.0
Name: 197, dtype: float64 2012.0 -17.6 40.7 1.0
198 year    2012.00
LAT      -17.53
LON      119.35
tc         1.00
Name: 198, dtype: float64 2012.0 -17.53 119.35 1.0
199 year    2012.00
LAT      -16.30
LON      110.95
tc         1.00
Name: 199, dtype: float64 2012.0 -16.3 110.95 1.0
200 year    2012.00
LAT      -16.21
LON       43.67
tc         1.00
Name: 200, dtype: float64 2012.0 -16.21 43.67 1.0
201 year    2012.00
LAT      -15.85
LON      108.30
tc         1.00
Name: 201, dtype: float64 2012.0 -15.85 108.3 1.0
202 year    2012.00
LAT      -14.67
LON       96.03
tc         1.00
Name: 202, dtype: float64 2012.0 -14.67 96.03 1.0
203 year    2012.0
LAT      -14.3
LON       67.7
tc         1.0
Name: 203, dtype: float64 2012.0 -14.3 67.7 1.0
204 year    2012.00
LAT      -13.95
LON       65.35
tc         1.00
Name: 204, dtype: float64 2012.0 -13.95 65.35 1.0
205 year    2012.0
LAT      -13.9
LON       66.9
tc         1.0
Name: 205, dtype: float64 2012.0 -13.9 66.9 1.0
206 year    2012.00
LAT      -13.45
LON       90.95
tc         1.00
Name: 206, dtype: float64 2012.0 -13.45 90.95 1.0
207 year    2012.00
LAT      -12.78
LON       76.63
tc         1.00
Name: 207, dtype: float64 2012.0 -12.78 76.63 1.0
208 year    2012.00
LAT      -12.55
LON       77.55
tc         1.00
Name: 208, dtype: float64 2012.0 -12.55 77.55 1.0
209 year    2012.00
LAT      -11.36
LON       56.62
tc         1.00
Name: 209, dtype: float64 2012.0 -11.36 56.62 1.0
210 year    2012.00
LAT       -9.45
LON       60.40
tc         1.00
Name: 210, dtype: float64 2012.0 -9.45 60.4 1.0
211 year    2012.00
LAT       -7.95
LON       71.15
tc         1.00
Name: 211, dtype: float64 2012.0 -7.95 71.15 1.0
212 year    2013.00
LAT      -21.05
LON       41.05
tc         1.00
Name: 212, dtype: float64 2013.0 -21.05 41.05 1.0
213 year    2013.00
LAT      -20.30
LON      117.65
tc         1.00
Name: 213, dtype: float64 2013.0 -20.3 117.65 1.0
214 year    2013.00
LAT      -17.03
LON      118.18
tc         1.00
Name: 214, dtype: float64 2013.0 -17.03 118.18 1.0
215 year    2013.00
LAT      -15.94
LON      120.70
tc         1.00
Name: 215, dtype: float64 2013.0 -15.94 120.7 1.0
216 year    2013.00
LAT      -15.86
LON      140.52
tc         1.00
Name: 216, dtype: float64 2013.0 -15.86 140.52 1.0
217 year    2013.0
LAT      -15.7
LON       72.4
tc         1.0
Name: 217, dtype: float64 2013.0 -15.7 72.4 1.0
218 year    2013.00
LAT      -13.45
LON      117.40
tc         1.00
Name: 218, dtype: float64 2013.0 -13.45 117.4 1.0
219 year    2013.00
LAT      -13.35
LON       65.40
tc         1.00
Name: 219, dtype: float64 2013.0 -13.35 65.4 1.0
220 year    2013.0
LAT      -12.7
LON       98.1
tc         1.0
Name: 220, dtype: float64 2013.0 -12.7 98.1 1.0
221 year    2013.0
LAT      -12.4
LON       82.0
tc         1.0
Name: 221, dtype: float64 2013.0 -12.4 82.0 1.0
222 year    2013.00
LAT      -11.95
LON      119.15
tc         1.00
Name: 222, dtype: float64 2013.0 -11.95 119.15 1.0
223 year    2013.00
LAT      -11.50
LON       80.65
tc         1.00
Name: 223, dtype: float64 2013.0 -11.5 80.65 1.0
224 year    2013.00
LAT      -11.46
LON      102.40
tc         1.00
Name: 224, dtype: float64 2013.0 -11.46 102.4 1.0
225 year    2013.00
LAT      -11.35
LON       67.20
tc         1.00
Name: 225, dtype: float64 2013.0 -11.35 67.2 1.0
226 year    2013.00
LAT      -11.05
LON       66.20
tc         1.00
Name: 226, dtype: float64 2013.0 -11.05 66.2 1.0
227 year    2013.00
LAT      -10.15
LON       52.35
tc         1.00
Name: 227, dtype: float64 2013.0 -10.15 52.35 1.0
228 year    2013.00
LAT       -9.78
LON       96.85
tc         1.00
Name: 228, dtype: float64 2013.0 -9.78 96.85 1.0
229 year    2013.00
LAT       -6.25
LON       85.20
tc         1.00
Name: 229, dtype: float64 2013.0 -6.25 85.2 1.0
230 year    2014.00
LAT      -20.15
LON       43.65
tc         1.00
Name: 230, dtype: float64 2014.0 -20.15 43.65 1.0
231 year    2014.00
LAT      -18.85
LON       40.05
tc         1.00
Name: 231, dtype: float64 2014.0 -18.85 40.05 1.0
232 year    2014.00
LAT      -17.10
LON       60.05
tc         1.00
Name: 232, dtype: float64 2014.0 -17.1 60.05 1.0
233 year    2014.00
LAT      -16.25
LON       79.60
tc         1.00
Name: 233, dtype: float64 2014.0 -16.25 79.6 1.0
234 year    2014.00
LAT      -15.60
LON       61.95
tc         1.00
Name: 234, dtype: float64 2014.0 -15.6 61.95 1.0
235 year    2014.00
LAT      -14.80
LON       70.35
tc         1.00
Name: 235, dtype: float64 2014.0 -14.8 70.35 1.0
236 year    2014.0
LAT      -12.6
LON       42.1
tc         1.0
Name: 236, dtype: float64 2014.0 -12.6 42.1 1.0
237 year    2014.00
LAT      -12.32
LON       91.54
tc         1.00
Name: 237, dtype: float64 2014.0 -12.32 91.54 1.0
238 year    2014.00
LAT      -11.95
LON       86.00
tc         1.00
Name: 238, dtype: float64 2014.0 -11.95 86.0 1.0
239 year    2014.00
LAT      -11.30
LON      140.05
tc         1.00
Name: 239, dtype: float64 2014.0 -11.3 140.05 1.0
240 year    2014.0
LAT      -10.9
LON       97.9
tc         1.0
Name: 240, dtype: float64 2014.0 -10.9 97.9 1.0
241 year    2014.0
LAT       -9.1
LON       96.6
tc         1.0
Name: 241, dtype: float64 2014.0 -9.1 96.6 1.0
242 year    2014.00
LAT       -8.55
LON       66.51
tc         1.00
Name: 242, dtype: float64 2014.0 -8.55 66.51 1.0
243 year    2015.00
LAT      -22.80
LON       42.85
tc         1.00
Name: 243, dtype: float64 2015.0 -22.8 42.85 1.0
244 year    2015.00
LAT      -19.21
LON       41.97
tc         1.00
Name: 244, dtype: float64 2015.0 -19.21 41.97 1.0
245 year    2015.0
LAT      -19.2
LON       50.0
tc         1.0
Name: 245, dtype: float64 2015.0 -19.2 50.0 1.0
246 year    2015.00
LAT      -17.20
LON       78.15
tc         1.00
Name: 246, dtype: float64 2015.0 -17.2 78.15 1.0
247 year    2015.00
LAT      -16.40
LON       72.05
tc         1.00

Name: 247, dtype: float64 2015.0 -16.4 72.05 1.0
248 year    2015.0
LAT      -16.0
LON       42.1
tc         1.0
Name: 248, dtype: float64 2015.0 -16.0 42.1 1.0
249 year    2015.0
LAT      -15.9
LON       53.7
tc         1.0
Name: 249, dtype: float64 2015.0 -15.9 53.7 1.0
250 year    2015.00
LAT      -15.34
LON      116.23
tc         1.00
Name: 250, dtype: float64 2015.0 -15.34 116.23 1.0
251 year    2015.0
LAT      -14.9
LON       63.9
tc         1.0
Name: 251, dtype: float64 2015.0 -14.9 63.9 1.0
252 year    2015.00
LAT      -14.63
LON      110.36
tc         1.00
Name: 252, dtype: float64 2015.0 -14.63 110.36 1.0
253 year    2015.0
LAT      -14.3
LON       70.5
tc         1.0
Name: 253, dtype: float64 2015.0 -14.3 70.5 1.0
254 year    2015.00
LAT      -12.85
LON       63.05
tc         1.00
Name: 254, dtype: float64 2015.0 -12.85 63.05 1.0
255 year    2015.0
LAT      -12.7
LON      149.6
tc         1.0
Name: 255, dtype: float64 2015.0 -12.7 149.6 1.0
256 year    2015.00
LAT      -11.67
LON       86.92
tc         1.00
Name: 256, dtype: float64 2015.0 -11.67 86.92 1.0
257 year    2015.00
LAT      -11.55
LON      139.65
tc         1.00
Name: 257, dtype: float64 2015.0 -11.55 139.65 1.0
258 year    2015.00
LAT       -9.75
LON       72.15
tc         1.00
Name: 258, dtype: float64 2015.0 -9.75 72.15 1.0
259 year    2016.0
LAT      -22.9
LON       51.6
tc         1.0
Name: 259, dtype: float64 2016.0 -22.9 51.6 1.0
260 year    2016.00
LAT      -17.06
LON      117.78
tc         1.00
Name: 260, dtype: float64 2016.0 -17.06 117.78 1.0
261 year    2016.00
LAT      -15.60
LON      115.45
tc         1.00
Name: 261, dtype: float64 2016.0 -15.6 115.45 1.0
262 year    2016.00
LAT      -15.14
LON       77.54
tc         1.00
Name: 262, dtype: float64 2016.0 -15.14 77.54 1.0
263 year    2016.00
LAT      -14.64
LON       75.69
tc         1.00
Name: 263, dtype: float64 2016.0 -14.64 75.69 1.0
264 year    2016.0
LAT      -12.9
LON       72.1
tc         1.0
Name: 264, dtype: float64 2016.0 -12.9 72.1 1.0
265 year    2016.00
LAT      -12.32
LON       94.44
tc         1.00
Name: 265, dtype: float64 2016.0 -12.32 94.44 1.0
266 year    2016.00
LAT      -11.27
LON       86.10
tc         1.00
Name: 266, dtype: float64 2016.0 -11.27 86.1 1.0
267 year    2016.0
LAT       -9.1
LON       69.7
tc         1.0
Name: 267, dtype: float64 2016.0 -9.1 69.7 1.0
268 year    2017.00
LAT      -21.55
LON       39.85
tc         1.00
Name: 268, dtype: float64 2017.0 -21.55 39.85 1.0
269 year    2017.0
LAT      -18.3
LON      118.9
tc         1.0
Name: 269, dtype: float64 2017.0 -18.3 118.9 1.0
270 year    2017.00
LAT      -18.10
LON      122.05
tc         1.00
Name: 270, dtype: float64 2017.0 -18.1 122.05 1.0
271 year    2017.00
LAT      -15.25
LON       69.95
tc         1.00
Name: 271, dtype: float64 2017.0 -15.25 69.95 1.0
272 year    2017.00
LAT      -14.85
LON       56.50
tc         1.00
Name: 272, dtype: float64 2017.0 -14.85 56.5 1.0
273 year    2017.00
LAT      -12.96
LON      111.09
tc         1.00
Name: 273, dtype: float64 2017.0 -12.96 111.09 1.0
274 year    2017.0
LAT      -12.7
LON       57.0
tc         1.0
Name: 274, dtype: float64 2017.0 -12.7 57.0 1.0
275 year    2017.00
LAT      -12.07
LON      100.14
tc         1.00
Name: 275, dtype: float64 2017.0 -12.07 100.14 1.0
276 year    2017.00
LAT      -11.65
LON      130.00
tc         1.00
Name: 276, dtype: float64 2017.0 -11.65 130.0 1.0
277 year    2017.0
LAT       -9.9
LON      130.2
tc         1.0
Name: 277, dtype: float64 2017.0 -9.9 130.2 1.0
278 year    2017.00
LAT       -8.55
LON      102.75
tc         1.00
Name: 278, dtype: float64 2017.0 -8.55 102.75 1.0
279 year    2018.00
LAT      -18.25
LON      121.10
tc         1.00
Name: 279, dtype: float64 2018.0 -18.25 121.1 1.0
280 year    2018.00
LAT      -16.75
LON       67.90
tc         1.00
Name: 280, dtype: float64 2018.0 -16.75 67.9 1.0
281 year    2018.00
LAT      -16.65
LON      121.95
tc         1.00
Name: 281, dtype: float64 2018.0 -16.65 121.95 1.0
282 year    2018.00
LAT      -15.45
LON       53.05
tc         1.00
Name: 282, dtype: float64 2018.0 -15.45 53.05 1.0
283 year    2018.00
LAT      -14.65
LON       54.50
tc         1.00
Name: 283, dtype: float64 2018.0 -14.65 54.5 1.0
284 year    2018.0
LAT      -13.1
LON       51.5
tc         1.0
Name: 284, dtype: float64 2018.0 -13.1 51.5 1.0
285 year    2018.0
LAT      -12.3
LON       54.2
tc         1.0
Name: 285, dtype: float64 2018.0 -12.3 54.2 1.0
286 year    2018.00
LAT      -11.90
LON       93.73
tc         1.00
Name: 286, dtype: float64 2018.0 -11.9 93.73 1.0
287 year    2018.00
LAT      -10.85
LON       61.05
tc         1.00
Name: 287, dtype: float64 2018.0 -10.85 61.05 1.0
288 year    2018.0
LAT      -10.6
LON       82.5
tc         1.0
Name: 288, dtype: float64 2018.0 -10.6 82.5 1.0
289 year    2018.00
LAT      -10.06
LON       72.28
tc         1.00
Name: 289, dtype: float64 2018.0 -10.06 72.28 1.0
290 year    2018.00
LAT       -9.35
LON      131.75
tc         1.00
Name: 290, dtype: float64 2018.0 -9.35 131.75 1.0
291 year    2018.00
LAT       -8.85
LON       92.25
tc         1.00
Name: 291, dtype: float64 2018.0 -8.85 92.25 1.0
292 year    2018.00
LAT       -8.75
LON       91.25
tc         1.00
Name: 292, dtype: float64 2018.0 -8.75 91.25 1.0
293 year    2018.00
LAT       -8.65
LON       61.30
tc         1.00
Name: 293, dtype: float64 2018.0 -8.65 61.3 1.0
294 year    2018.0
LAT       -5.1
LON       90.9
tc         1.0
Name: 294, dtype: float64 2018.0 -5.1 90.9 1.0
295 year    2019.00
LAT      -23.25
LON       38.35
tc         1.00
Name: 295, dtype: float64 2019.0 -23.25 38.35 1.0
296 year    2019.0
LAT      -18.3
LON       60.3
tc         1.0
Name: 296, dtype: float64 2019.0 -18.3 60.3 1.0
297 year    2019.00
LAT      -16.95
LON       41.25
tc         1.00
Name: 297, dtype: float64 2019.0 -16.95 41.25 1.0
298 year    2019.00
LAT      -16.55
LON      121.70
tc         1.00
Name: 298, dtype: float64 2019.0 -16.55 121.7 1.0
299 year    2019.00
LAT      -15.85
LON      159.60
tc         1.00
Name: 299, dtype: float64 2019.0 -15.85 159.6 1.0
300 year    2019.00
LAT      -15.75
LON       64.60
tc         1.00
Name: 300, dtype: float64 2019.0 -15.75 64.6 1.0
301 year    2019.0
LAT      -14.7
LON       62.7
tc         1.0
Name: 301, dtype: float64 2019.0 -14.7 62.7 1.0
302 year    2019.00
LAT      -14.40
LON      120.15
tc         1.00
Name: 302, dtype: float64 2019.0 -14.4 120.15 1.0
303 year    2019.00
LAT      -12.40
LON       53.65
tc         1.00
Name: 303, dtype: float64 2019.0 -12.4 53.65 1.0
304 year    2019.00
LAT      -11.55
LON      128.10
tc         1.00
Name: 304, dtype: float64 2019.0 -11.55 128.1 1.0
305 year    2019.00
LAT      -11.35
LON       75.35
tc         1.00
Name: 305, dtype: float64 2019.0 -11.35 75.35 1.0
306 year    2019.00
LAT      -10.41
LON       97.10
tc         1.00
Name: 306, dtype: float64 2019.0 -10.41 97.1 1.0
307 year    2019.00
LAT      -10.05
LON       51.45
tc         1.00
Name: 307, dtype: float64 2019.0 -10.05 51.45 1.0
308 year    2019.0
LAT       -7.8
LON      128.8
tc         1.0
Name: 308, dtype: float64 2019.0 -7.8 128.8 1.0
309 year    2019.0
LAT       -7.6
LON       81.7
tc         1.0
Name: 309, dtype: float64 2019.0 -7.6 81.7 1.0
310 year    2019.00
LAT       -7.35
LON       64.25
tc         1.00
Name: 310, dtype: float64 2019.0 -7.35 64.25 1.0
311 year    2019.0
LAT       -6.6
LON       51.2
tc         1.0
Name: 311, dtype: float64 2019.0 -6.6 51.2 1.0
312 year    2020.00
LAT      -22.20
LON       67.25
tc         1.00
Name: 312, dtype: float64 2020.0 -22.2 67.25 1.0
313 year    2020.0
LAT      -18.7
LON       53.6
tc         1.0
Name: 313, dtype: float64 2020.0 -18.7 53.6 1.0
314 year    2020.0
LAT      -16.8
LON      120.4
tc         1.0
Name: 314, dtype: float64 2020.0 -16.8 120.4 1.0
315 year    2020.0
LAT      -16.2
LON       66.9
tc         1.0
Name: 315, dtype: float64 2020.0 -16.2 66.9 1.0
316 year    2020.0
LAT      -15.8
LON       66.4
tc         1.0
Name: 316, dtype: float64 2020.0 -15.8 66.4 1.0
317 year    2020.0
LAT      -15.8
LON       74.6
tc         1.0
Name: 317, dtype: float64 2020.0 -15.8 74.6 1.0
318 year    2020.00
LAT      -15.56
LON       57.17
tc         1.00
Name: 318, dtype: float64 2020.0 -15.56 57.17 1.0
319 year    2020.00
LAT      -15.45
LON      139.37
tc         1.00
Name: 319, dtype: float64 2020.0 -15.45 139.37 1.0
320 year    2020.0
LAT      -15.4
LON      121.2
tc         1.0
Name: 320, dtype: float64 2020.0 -15.4 121.2 1.0
321 year    2020.00
LAT      -14.40
LON       52.35
tc         1.00
Name: 321, dtype: float64 2020.0 -14.4 52.35 1.0
322 year    2020.0
LAT      -14.2
LON       83.1
tc         1.0
Name: 322, dtype: float64 2020.0 -14.2 83.1 1.0
323 year    2020.00
LAT      -14.15
LON       87.00
tc         1.00
Name: 323, dtype: float64 2020.0 -14.15 87.0 1.0
324 year    2020.00
LAT      -13.85
LON      116.55
tc         1.00
Name: 324, dtype: float64 2020.0 -13.85 116.55 1.0
325 year    2020.00
LAT      -13.35
LON      118.55
tc         1.00
Name: 325, dtype: float64 2020.0 -13.35 118.55 1.0
326 year    2020.00
LAT      -13.05
LON      127.15
tc         1.00
Name: 326, dtype: float64 2020.0 -13.05 127.15 1.0
327 year    2020.00
LAT      -12.75
LON       69.65
tc         1.00
Name: 327, dtype: float64 2020.0 -12.75 69.65 1.0
328 year    2020.00
LAT      -11.25
LON      107.60
tc         1.00
Name: 328, dtype: float64 2020.0 -11.25 107.6 1.0
329 year    2020.0
LAT       -7.0
LON       92.7
tc         1.0
Name: 329, dtype: float64 2020.0 -7.0 92.7 1.0
330 year    2020.0
LAT       -6.7
LON       81.1
tc         1.0
Name: 330, dtype: float64 2020.0 -6.7 81.1 1.0
331 year    2021.0
LAT      -24.6
LON      113.4
tc         1.0
Name: 331, dtype: float64 2021.0 -24.6 113.4 1.0
332 year    2021.00
LAT      -23.65
LON       56.65
tc         1.00
Name: 332, dtype: float64 2021.0 -23.65 56.65 1.0
333 year    2021.00
LAT      -21.40
LON       37.25
tc         1.00
Name: 333, dtype: float64 2021.0 -21.4 37.25 1.0
334 year    2021.0
LAT      -17.0
LON      119.8
tc         1.0
Name: 334, dtype: float64 2021.0 -17.0 119.8 1.0
335 year    2021.00
LAT      -16.20
LON       94.23
tc         1.00
Name: 335, dtype: float64 2021.0 -16.2 94.23 1.0
336 year    2021.00
LAT      -15.55
LON       69.25
tc         1.00
Name: 336, dtype: float64 2021.0 -15.55 69.25 1.0
337 year    2021.0
LAT      -14.1
LON      104.9
tc         1.0
Name: 337, dtype: float64 2021.0 -14.1 104.9 1.0
338 year    2021.0
LAT      -13.8
LON      102.2
tc         1.0
Name: 338, dtype: float64 2021.0 -13.8 102.2 1.0
339 year    2021.00
LAT      -12.60
LON       99.25
tc         1.00
Name: 339, dtype: float64 2021.0 -12.6 99.25 1.0
340 year    2021.0
LAT      -12.4
LON       66.0
tc         1.0
Name: 340, dtype: float64 2021.0 -12.4 66.0 1.0
341 year    2021.00
LAT      -12.05
LON       81.60
tc         1.00
Name: 341, dtype: float64 2021.0 -12.05 81.6 1.0
342 year    2021.00
LAT      -11.60
LON       72.15
tc         1.00
Name: 342, dtype: float64 2021.0 -11.6 72.15 1.0
343 year    2021.00
LAT      -10.80
LON       52.35
tc         1.00
Name: 343, dtype: float64 2021.0 -10.8 52.35 1.0
344 year    2021.00
LAT      -10.35
LON      123.35
tc         1.00
Name: 344, dtype: float64 2021.0 -10.35 123.35 1.0
345 year    2022.0
LAT      -15.7
LON       44.4
tc         1.0
Name: 345, dtype: float64 2022.0 -15.7 44.4 1.0
346 year    2022.0
LAT      -12.8
LON      129.1
tc         1.0
Name: 346, dtype: float64 2022.0 -12.8 129.1 1.0
0 year    1984.00
LAT       -8.38
LON      179.23
tc         1.00
Name: 0, dtype: float64 1984.0 -8.38 179.23 1.0
1 year    1992.0
LAT      -13.5
LON      182.1
tc         1.0
Name: 1, dtype: float64 1992.0 -13.5 182.1 1.0
2 year    2000.00
LAT      -23.25
LON     -135.25
tc         1.00
Name: 2, dtype: float64 2000.0 -23.25 -135.25 1.0
3 year    2000.00
LAT      -22.60
LON      179.45
tc         1.00
Name: 3, dtype: float64 2000.0 -22.6 179.45 1.0
4 year    2000.00
LAT      -14.77
LON      159.54
tc         1.00
Name: 4, dtype: float64 2000.0 -14.77 159.54 1.0
5 year    2000.00
LAT      -14.35
LON      123.29
tc         1.00
Name: 5, dtype: float64 2000.0 -14.35 123.29 1.0
6 year    2001.0
LAT      -22.5
LON     -162.5
tc         1.0
Name: 6, dtype: float64 2001.0 -22.5 -162.5 1.0
7 year    2001.00
LAT      -21.54
LON     -159.26
tc         1.00
Name: 7, dtype: float64 2001.0 -21.54 -159.26 1.0
8 year    2001.00
LAT      -20.25
LON     -134.85
tc         1.00
Name: 8, dtype: float64 2001.0 -20.25 -134.85 1.0
9 year    2001.00
LAT      -19.57
LON      165.60
tc         1.00
Name: 9, dtype: float64 2001.0 -19.57 165.6 1.0
10 year    2001.00
LAT      -16.13
LON      140.33
tc         1.00
Name: 10, dtype: float64 2001.0 -16.13 140.33 1.0
11 year    2001.00
LAT      -14.13
LON      136.20
tc         1.00
Name: 11, dtype: float64 2001.0 -14.13 136.2 1.0
12 year    2001.00
LAT      -13.66
LON      165.84
tc         1.00
Name: 12, dtype: float64 2001.0 -13.66 165.84 1.0
13 year    2001.00
LAT      -12.75
LON      164.80
tc         1.00
Name: 13, dtype: float64 2001.0 -12.75 164.8 1.0
14 year    2001.00
LAT      -11.41
LON     -174.67
tc         1.00
Name: 14, dtype: float64 2001.0 -11.41 -174.67 1.0
15 year    2001.00
LAT       -9.17
LON      133.57
tc         1.00
Name: 15, dtype: float64 2001.0 -9.17 133.57 1.0
16 year    2001.0
LAT       -6.7
LON      129.3
tc         1.0
Name: 16, dtype: float64 2001.0 -6.7 129.3 1.0
17 year    2002.0
LAT      -20.4
LON      175.6
tc         1.0
Name: 17, dtype: float64 2002.0 -20.4 175.6 1.0
18 year    2002.00
LAT      -20.19
LON      156.27
tc         1.00
Name: 18, dtype: float64 2002.0 -20.19 156.27 1.0
19 year    2002.0
LAT      -19.9
LON      165.4
tc         1.0
Name: 19, dtype: float64 2002.0 -19.9 165.4 1.0
20 year    2002.00
LAT      -19.20
LON     -176.43
tc         1.00
Name: 20, dtype: float64 2002.0 -19.2 -176.43 1.0
21 year    2002.00
LAT      -19.17
LON      159.48
tc         1.00
Name: 21, dtype: float64 2002.0 -19.17 159.48 1.0
22 year    2002.00
LAT      -14.89
LON      138.99
tc         1.00
Name: 22, dtype: float64 2002.0 -14.89 138.99 1.0
23 year    2002.00
LAT      -10.73
LON      177.53
tc         1.00
Name: 23, dtype: float64 2002.0 -10.73 177.53 1.0
24 year    2002.00
LAT       -7.88
LON      153.73
tc         1.00

Name: 24, dtype: float64 2002.0 -7.88 153.73 1.0
25 year    2003.00
LAT      -19.52
LON      155.10
tc         1.00
Name: 25, dtype: float64 2003.0 -19.52 155.1 1.0
26 year    2003.00
LAT      -19.10
LON      183.45
tc         1.00
Name: 26, dtype: float64 2003.0 -19.1 183.45 1.0
27 year    2003.00
LAT      -16.35
LON      172.25
tc         1.00
Name: 27, dtype: float64 2003.0 -16.35 172.25 1.0
28 year    2003.00
LAT      -16.10
LON     -175.43
tc         1.00
Name: 28, dtype: float64 2003.0 -16.1 -175.43 1.0
29 year    2003.00
LAT      -13.85
LON     -162.75
tc         1.00
Name: 29, dtype: float64 2003.0 -13.85 -162.75 1.0
30 year    2003.00
LAT      -13.20
LON      161.05
tc         1.00
Name: 30, dtype: float64 2003.0 -13.2 161.05 1.0
31 year    2003.00
LAT      -11.33
LON      169.25
tc         1.00
Name: 31, dtype: float64 2003.0 -11.33 169.25 1.0
32 year    2003.00
LAT      -10.93
LON      130.73
tc         1.00
Name: 32, dtype: float64 2003.0 -10.93 130.73 1.0
33 year    2003.00
LAT      -10.90
LON      180.63
tc         1.00
Name: 33, dtype: float64 2003.0 -10.9 180.63 1.0
34 year    2003.00
LAT       -9.87
LON      135.27
tc         1.00
Name: 34, dtype: float64 2003.0 -9.87 135.27 1.0
35 year    2004.00
LAT      -19.88
LON      154.48
tc         1.00
Name: 35, dtype: float64 2004.0 -19.88 154.48 1.0
36 year    2004.0
LAT      -17.0
LON      177.3
tc         1.0
Name: 36, dtype: float64 2004.0 -17.0 177.3 1.0
37 year    2004.00
LAT      -16.70
LON      139.85
tc         1.00
Name: 37, dtype: float64 2004.0 -16.7 139.85 1.0
38 year    2004.00
LAT      -15.20
LON      173.25
tc         1.00
Name: 38, dtype: float64 2004.0 -15.2 173.25 1.0
39 year    2004.00
LAT      -14.87
LON      121.23
tc         1.00
Name: 39, dtype: float64 2004.0 -14.87 121.23 1.0
40 year    2004.00
LAT      -11.90
LON      127.67
tc         1.00
Name: 40, dtype: float64 2004.0 -11.9 127.67 1.0
41 year    2004.00
LAT       -9.35
LON      184.80
tc         1.00
Name: 41, dtype: float64 2004.0 -9.35 184.8 1.0
42 year    2005.00
LAT      -21.75
LON      196.18
tc         1.00
Name: 42, dtype: float64 2005.0 -21.75 196.18 1.0
43 year    2005.0
LAT      -14.2
LON      139.7
tc         1.0
Name: 43, dtype: float64 2005.0 -14.2 139.7 1.0
44 year    2005.00
LAT      -14.07
LON     -167.65
tc         1.00
Name: 44, dtype: float64 2005.0 -14.07 -167.65 1.0
45 year    2005.00
LAT      -12.81
LON      148.06
tc         1.00
Name: 45, dtype: float64 2005.0 -12.81 148.06 1.0
46 year    2005.0
LAT      -12.8
LON     -165.9
tc         1.0
Name: 46, dtype: float64 2005.0 -12.8 -165.9 1.0
47 year    2005.00
LAT      -11.57
LON      173.05
tc         1.00
Name: 47, dtype: float64 2005.0 -11.57 173.05 1.0
48 year    2005.00
LAT       -9.28
LON     -177.80
tc         1.00
Name: 48, dtype: float64 2005.0 -9.28 -177.8 1.0
49 year    2005.00
LAT       -8.27
LON      181.07
tc         1.00
Name: 49, dtype: float64 2005.0 -8.27 181.07 1.0
50 year    2006.00
LAT      -17.28
LON     -174.90
tc         1.00
Name: 50, dtype: float64 2006.0 -17.28 -174.9 1.0
51 year    2006.00
LAT      -17.22
LON      150.33
tc         1.00
Name: 51, dtype: float64 2006.0 -17.22 150.33 1.0
52 year    2006.00
LAT      -17.15
LON      187.20
tc         1.00
Name: 52, dtype: float64 2006.0 -17.15 187.2 1.0
53 year    2006.00
LAT      -17.07
LON      156.73
tc         1.00
Name: 53, dtype: float64 2006.0 -17.07 156.73 1.0
54 year    2006.00
LAT      -15.79
LON      163.72
tc         1.00
Name: 54, dtype: float64 2006.0 -15.79 163.72 1.0
55 year    2006.00
LAT      -14.87
LON      170.51
tc         1.00
Name: 55, dtype: float64 2006.0 -14.87 170.51 1.0
56 year    2006.00
LAT      -14.76
LON     -174.13
tc         1.00
Name: 56, dtype: float64 2006.0 -14.76 -174.13 1.0
57 year    2006.00
LAT      -12.20
LON      149.98
tc         1.00
Name: 57, dtype: float64 2006.0 -12.2 149.98 1.0
58 year    2006.00
LAT      -12.15
LON      162.25
tc         1.00
Name: 58, dtype: float64 2006.0 -12.15 162.25 1.0
59 year    2006.0
LAT      -11.7
LON      164.9
tc         1.0
Name: 59, dtype: float64 2006.0 -11.7 164.9 1.0
60 year    2006.00
LAT      -11.07
LON      145.93
tc         1.00
Name: 60, dtype: float64 2006.0 -11.07 145.93 1.0
61 year    2007.00
LAT      -26.09
LON     -148.64
tc         1.00
Name: 61, dtype: float64 2007.0 -26.09 -148.64 1.0
62 year    2007.00
LAT      -17.10
LON      180.55
tc         1.00
Name: 62, dtype: float64 2007.0 -17.1 180.55 1.0
63 year    2007.00
LAT      -15.83
LON      139.43
tc         1.00
Name: 63, dtype: float64 2007.0 -15.83 139.43 1.0
64 year    2007.0
LAT      -15.6
LON      178.1
tc         1.0
Name: 64, dtype: float64 2007.0 -15.6 178.1 1.0
65 year    2007.0
LAT      -14.1
LON      129.4
tc         1.0
Name: 65, dtype: float64 2007.0 -14.1 129.4 1.0
66 year    2007.00
LAT      -13.77
LON     -158.07
tc         1.00
Name: 66, dtype: float64 2007.0 -13.77 -158.07 1.0
67 year    2007.00
LAT      -12.75
LON      162.05
tc         1.00
Name: 67, dtype: float64 2007.0 -12.75 162.05 1.0
68 year    2007.00
LAT      -12.03
LON      178.27
tc         1.00
Name: 68, dtype: float64 2007.0 -12.03 178.27 1.0
69 year    2007.0
LAT      -11.2
LON      147.4
tc         1.0
Name: 69, dtype: float64 2007.0 -11.2 147.4 1.0
70 year    2008.00
LAT      -21.43
LON     -175.67
tc         1.00
Name: 70, dtype: float64 2008.0 -21.43 -175.67 1.0
71 year    2008.0
LAT      -21.2
LON      154.5
tc         1.0
Name: 71, dtype: float64 2008.0 -21.2 154.5 1.0
72 year    2008.0
LAT      -19.4
LON      163.8
tc         1.0
Name: 72, dtype: float64 2008.0 -19.4 163.8 1.0
73 year    2008.0
LAT      -16.0
LON      180.2
tc         1.0
Name: 73, dtype: float64 2008.0 -16.0 180.2 1.0
74 year    2008.00
LAT      -14.87
LON      164.73
tc         1.00
Name: 74, dtype: float64 2008.0 -14.87 164.73 1.0
75 year    2008.00
LAT      -14.15
LON      127.78
tc         1.00
Name: 75, dtype: float64 2008.0 -14.15 127.78 1.0
76 year    2009.00
LAT      -21.20
LON     -158.25
tc         1.00
Name: 76, dtype: float64 2009.0 -21.2 -158.25 1.0
77 year    2009.00
LAT      -20.55
LON      164.85
tc         1.00
Name: 77, dtype: float64 2009.0 -20.55 164.85 1.0
78 year    2009.00
LAT      -20.05
LON     -163.25
tc         1.00
Name: 78, dtype: float64 2009.0 -20.05 -163.25 1.0
79 year    2009.00
LAT      -19.65
LON      183.15
tc         1.00
Name: 79, dtype: float64 2009.0 -19.65 183.15 1.0
80 year    2009.00
LAT      -18.20
LON      184.11
tc         1.00
Name: 80, dtype: float64 2009.0 -18.2 184.11 1.0
81 year    2009.00
LAT      -17.32
LON      159.40
tc         1.00
Name: 81, dtype: float64 2009.0 -17.32 159.4 1.0
82 year    2009.00
LAT      -16.64
LON      147.55
tc         1.00
Name: 82, dtype: float64 2009.0 -16.64 147.55 1.0
83 year    2009.00
LAT      -16.15
LON      140.03
tc         1.00
Name: 83, dtype: float64 2009.0 -16.15 140.03 1.0
84 year    2009.00
LAT      -13.44
LON      147.05
tc         1.00
Name: 84, dtype: float64 2009.0 -13.44 147.05 1.0
85 year    2009.00
LAT      -12.95
LON      174.95
tc         1.00
Name: 85, dtype: float64 2009.0 -12.95 174.95 1.0
86 year    2009.00
LAT      -12.55
LON      128.60
tc         1.00
Name: 86, dtype: float64 2009.0 -12.55 128.6 1.0
87 year    2009.00
LAT       -7.20
LON      134.55
tc         1.00
Name: 87, dtype: float64 2009.0 -7.2 134.55 1.0
88 year    2010.00
LAT      -25.84
LON      178.04
tc         1.00
Name: 88, dtype: float64 2010.0 -25.84 178.04 1.0
89 year    2010.00
LAT      -16.40
LON      151.78
tc         1.00
Name: 89, dtype: float64 2010.0 -16.4 151.78 1.0
90 year    2010.00
LAT      -16.39
LON      147.59
tc         1.00
Name: 90, dtype: float64 2010.0 -16.39 147.59 1.0
91 year    2010.00
LAT      -15.15
LON     -170.00
tc         1.00
Name: 91, dtype: float64 2010.0 -15.15 -170.0 1.0
92 year    2010.00
LAT      -14.86
LON      166.41
tc         1.00
Name: 92, dtype: float64 2010.0 -14.86 166.41 1.0
93 year    2010.00
LAT      -13.22
LON      136.57
tc         1.00
Name: 93, dtype: float64 2010.0 -13.22 136.57 1.0
94 year    2010.00
LAT      -11.50
LON      193.35
tc         1.00
Name: 94, dtype: float64 2010.0 -11.5 193.35 1.0
95 year    2010.00
LAT      -10.70
LON     -162.55
tc         1.00
Name: 95, dtype: float64 2010.0 -10.7 -162.55 1.0
96 year    2010.00
LAT      -10.55
LON     -175.65
tc         1.00
Name: 96, dtype: float64 2010.0 -10.55 -175.65 1.0
97 year    2010.00
LAT       -9.25
LON     -158.60
tc         1.00
Name: 97, dtype: float64 2010.0 -9.25 -158.6 1.0
98 year    2011.00
LAT      -22.87
LON      185.47
tc         1.00
Name: 98, dtype: float64 2011.0 -22.87 185.47 1.0
99 year    2011.00
LAT      -20.45
LON      180.95
tc         1.00
Name: 99, dtype: float64 2011.0 -20.45 180.95 1.0
100 year    2011.00
LAT      -18.83
LON      169.37
tc         1.00
Name: 100, dtype: float64 2011.0 -18.83 169.37 1.0
101 year    2011.00
LAT      -15.46
LON      148.98
tc         1.00
Name: 101, dtype: float64 2011.0 -15.46 148.98 1.0
102 year    2011.00
LAT      -15.27
LON      169.30
tc         1.00
Name: 102, dtype: float64 2011.0 -15.27 169.3 1.0
103 year    2011.00
LAT      -13.83
LON      186.07
tc         1.00
Name: 103, dtype: float64 2011.0 -13.83 186.07 1.0
104 year    2011.00
LAT      -13.30
LON      170.65
tc         1.00
Name: 104, dtype: float64 2011.0 -13.3 170.65 1.0
105 year    2011.00
LAT      -12.90
LON      149.95
tc         1.00
Name: 105, dtype: float64 2011.0 -12.9 149.95 1.0
106 year    2011.00
LAT      -10.35
LON      132.70
tc         1.00
Name: 106, dtype: float64 2011.0 -10.35 132.7 1.0
107 year    2012.00
LAT      -18.10
LON      183.95
tc         1.00
Name: 107, dtype: float64 2012.0 -18.1 183.95 1.0
108 year    2012.00
LAT      -17.25
LON      150.30
tc         1.00
Name: 108, dtype: float64 2012.0 -17.25 150.3 1.0
109 year    2012.00
LAT      -17.25
LON      169.30
tc         1.00
Name: 109, dtype: float64 2012.0 -17.25 169.3 1.0
110 year    2012.0
LAT      -14.3
LON      184.4
tc         1.0
Name: 110, dtype: float64 2012.0 -14.3 184.4 1.0
111 year    2012.0
LAT      -11.7
LON      154.9
tc         1.0
Name: 111, dtype: float64 2012.0 -11.7 154.9 1.0
112 year    2012.00
LAT      -11.01
LON      160.66
tc         1.00
Name: 112, dtype: float64 2012.0 -11.01 160.66 1.0
113 year    2013.00
LAT      -19.68
LON     -157.01
tc         1.00
Name: 113, dtype: float64 2013.0 -19.68 -157.01 1.0
114 year    2013.00
LAT      -15.86
LON      140.52
tc         1.00
Name: 114, dtype: float64 2013.0 -15.86 140.52 1.0
115 year    2013.00
LAT      -15.20
LON      155.65
tc         1.00
Name: 115, dtype: float64 2013.0 -15.2 155.65 1.0
116 year    2013.00
LAT      -13.55
LON      151.10
tc         1.00
Name: 116, dtype: float64 2013.0 -13.55 151.1 1.0
117 year    2013.00
LAT      -13.45
LON      117.40
tc         1.00
Name: 117, dtype: float64 2013.0 -13.45 117.4 1.0
118 year    2013.0
LAT      -13.4
LON      147.3
tc         1.0
Name: 118, dtype: float64 2013.0 -13.4 147.3 1.0
119 year    2013.0
LAT      -12.7
LON      183.3
tc         1.0
Name: 119, dtype: float64 2013.0 -12.7 183.3 1.0
120 year    2014.00
LAT      -24.74
LON     -158.48
tc         1.00
Name: 120, dtype: float64 2014.0 -24.74 -158.48 1.0
121 year    2014.00
LAT      -19.10
LON     -175.85
tc         1.00
Name: 121, dtype: float64 2014.0 -19.1 -175.85 1.0
122 year    2014.0
LAT      -19.0
LON      151.2
tc         1.0
Name: 122, dtype: float64 2014.0 -19.0 151.2 1.0
123 year    2014.00
LAT      -18.25
LON      162.65
tc         1.00
Name: 123, dtype: float64 2014.0 -18.25 162.65 1.0
124 year    2014.00
LAT      -17.55
LON      148.60
tc         1.00
Name: 124, dtype: float64 2014.0 -17.55 148.6 1.0
125 year    2014.00
LAT      -17.35
LON      181.40
tc         1.00
Name: 125, dtype: float64 2014.0 -17.35 181.4 1.0
126 year    2014.00
LAT      -16.34
LON      161.12
tc         1.00
Name: 126, dtype: float64 2014.0 -16.34 161.12 1.0
127 year    2014.00
LAT      -14.88
LON      166.85
tc         1.00
Name: 127, dtype: float64 2014.0 -14.88 166.85 1.0
128 year    2014.00
LAT      -11.60
LON      156.45
tc         1.00
Name: 128, dtype: float64 2014.0 -11.6 156.45 1.0
129 year    2014.00
LAT      -11.30
LON      140.05
tc         1.00
Name: 129, dtype: float64 2014.0 -11.3 140.05 1.0
130 year    2015.00
LAT      -21.42
LON     -177.11
tc         1.00
Name: 130, dtype: float64 2015.0 -21.42 -177.11 1.0
131 year    2015.00
LAT      -17.26
LON      161.20
tc         1.00
Name: 131, dtype: float64 2015.0 -17.26 161.2 1.0
132 year    2015.00
LAT      -16.45
LON      155.85
tc         1.00
Name: 132, dtype: float64 2015.0 -16.45 155.85 1.0
133 year    2015.0
LAT      -14.2
LON      175.1
tc         1.0
Name: 133, dtype: float64 2015.0 -14.2 175.1 1.0
134 year    2015.0
LAT      -13.4
LON      161.2
tc         1.0
Name: 134, dtype: float64 2015.0 -13.4 161.2 1.0
135 year    2015.00
LAT      -13.15
LON      184.50
tc         1.00
Name: 135, dtype: float64 2015.0 -13.15 184.5 1.0
136 year    2015.0
LAT      -12.7
LON      149.6
tc         1.0
Name: 136, dtype: float64 2015.0 -12.7 149.6 1.0
137 year    2015.00
LAT      -12.38
LON     -151.38
tc         1.00
Name: 137, dtype: float64 2015.0 -12.38 -151.38 1.0
138 year    2015.00
LAT      -11.55
LON      139.65
tc         1.00
Name: 138, dtype: float64 2015.0 -11.55 139.65 1.0
139 year    2015.0
LAT      -11.0
LON      172.2
tc         1.0
Name: 139, dtype: float64 2015.0 -11.0 172.2 1.0
140 year    2015.00
LAT       -9.50
LON      190.04
tc         1.00
Name: 140, dtype: float64 2015.0 -9.5 190.04 1.0
141 year    2015.00
LAT       -8.45
LON      169.95
tc         1.00
Name: 141, dtype: float64 2015.0 -8.45 169.95 1.0
142 year    2015.00
LAT       -5.35
LON      160.25
tc         1.00
Name: 142, dtype: float64 2015.0 -5.35 160.25 1.0
143 year    2016.00
LAT      -19.99
LON      179.61
tc         1.00
Name: 143, dtype: float64 2016.0 -19.99 179.61 1.0
144 year    2016.00
LAT      -18.65
LON     -155.70
tc         1.00
Name: 144, dtype: float64 2016.0 -18.65 -155.7 1.0
145 year    2016.00
LAT      -16.20
LON      156.36
tc         1.00
Name: 145, dtype: float64 2016.0 -16.2 156.36 1.0
146 year    2016.0
LAT      -16.0
LON      139.5
tc         1.0
Name: 146, dtype: float64 2016.0 -16.0 139.5 1.0
147 year    2016.0
LAT      -15.1
LON      170.8
tc         1.0
Name: 147, dtype: float64 2016.0 -15.1 170.8 1.0
148 year    2016.00
LAT      -13.80
LON     -164.95
tc         1.00
Name: 148, dtype: float64 2016.0 -13.8 -164.95 1.0
149 year    2016.00
LAT      -12.87
LON     -178.80
tc         1.00
Name: 149, dtype: float64 2016.0 -12.87 -178.8 1.0
150 year    2017.0
LAT      -19.0
LON     -169.8
tc         1.0

Name: 150, dtype: float64 2017.0 -19.0 -169.8 1.0
151 year    2017.0
LAT      -18.8
LON     -168.2
tc         1.0
Name: 151, dtype: float64 2017.0 -18.8 -168.2 1.0
152 year    2017.0
LAT      -18.6
LON      182.9
tc         1.0
Name: 152, dtype: float64 2017.0 -18.6 182.9 1.0
153 year    2017.00
LAT      -17.05
LON      152.10
tc         1.00
Name: 153, dtype: float64 2017.0 -17.05 152.1 1.0
154 year    2017.0
LAT      -16.6
LON      139.2
tc         1.0
Name: 154, dtype: float64 2017.0 -16.6 139.2 1.0
155 year    2017.0
LAT      -16.4
LON      186.4
tc         1.0
Name: 155, dtype: float64 2017.0 -16.4 186.4 1.0
156 year    2017.00
LAT      -15.44
LON      167.88
tc         1.00
Name: 156, dtype: float64 2017.0 -15.44 167.88 1.0
157 year    2017.00
LAT      -13.20
LON      171.05
tc         1.00
Name: 157, dtype: float64 2017.0 -13.2 171.05 1.0
158 year    2017.00
LAT      -11.65
LON      130.00
tc         1.00
Name: 158, dtype: float64 2017.0 -11.65 130.0 1.0
159 year    2017.0
LAT       -9.9
LON      130.2
tc         1.0
Name: 159, dtype: float64 2017.0 -9.9 130.2 1.0
160 year    2018.0
LAT      -22.5
LON      158.1
tc         1.0
Name: 160, dtype: float64 2018.0 -22.5 158.1 1.0
161 year    2018.0
LAT      -17.6
LON      173.9
tc         1.0
Name: 161, dtype: float64 2018.0 -17.6 173.9 1.0
162 year    2018.00
LAT      -16.30
LON      170.55
tc         1.00
Name: 162, dtype: float64 2018.0 -16.3 170.55 1.0
163 year    2018.0
LAT      -15.7
LON      180.7
tc         1.0
Name: 163, dtype: float64 2018.0 -15.7 180.7 1.0
164 year    2018.00
LAT      -15.60
LON      159.56
tc         1.00
Name: 164, dtype: float64 2018.0 -15.6 159.56 1.0
165 year    2018.00
LAT      -15.49
LON      169.96
tc         1.00
Name: 165, dtype: float64 2018.0 -15.49 169.96 1.0
166 year    2018.00
LAT      -15.45
LON      160.10
tc         1.00
Name: 166, dtype: float64 2018.0 -15.45 160.1 1.0
167 year    2018.0
LAT      -13.8
LON      154.3
tc         1.0
Name: 167, dtype: float64 2018.0 -13.8 154.3 1.0
168 year    2018.00
LAT      -12.73
LON      139.65
tc         1.00
Name: 168, dtype: float64 2018.0 -12.73 139.65 1.0
169 year    2018.00
LAT      -10.39
LON      161.40
tc         1.00
Name: 169, dtype: float64 2018.0 -10.39 161.4 1.0
170 year    2018.00
LAT       -9.76
LON      136.07
tc         1.00
Name: 170, dtype: float64 2018.0 -9.76 136.07 1.0
171 year    2019.0
LAT      -16.6
LON     -176.7
tc         1.0
Name: 171, dtype: float64 2019.0 -16.6 -176.7 1.0
172 year    2019.00
LAT      -15.85
LON      159.60
tc         1.00
Name: 172, dtype: float64 2019.0 -15.85 159.6 1.0
173 year    2019.0
LAT      -14.9
LON     -175.6
tc         1.0
Name: 173, dtype: float64 2019.0 -14.9 -175.6 1.0
174 year    2019.00
LAT      -13.95
LON      164.30
tc         1.00
Name: 174, dtype: float64 2019.0 -13.95 164.3 1.0
175 year    2019.00
LAT      -12.86
LON      175.72
tc         1.00
Name: 175, dtype: float64 2019.0 -12.86 175.72 1.0
176 year    2019.0
LAT       -9.9
LON      168.6
tc         1.0
Name: 176, dtype: float64 2019.0 -9.9 168.6 1.0
177 year    2019.00
LAT       -9.05
LON      150.35
tc         1.00
Name: 177, dtype: float64 2019.0 -9.05 150.35 1.0
178 year    2019.0
LAT       -8.0
LON      175.4
tc         1.0
Name: 178, dtype: float64 2019.0 -8.0 175.4 1.0
179 year    2020.0
LAT      -20.6
LON     -167.8
tc         1.0
Name: 179, dtype: float64 2020.0 -20.6 -167.8 1.0
180 year    2020.0
LAT      -17.1
LON     -173.5
tc         1.0
Name: 180, dtype: float64 2020.0 -17.1 -173.5 1.0
181 year    2020.00
LAT      -16.75
LON      154.75
tc         1.00
Name: 181, dtype: float64 2020.0 -16.75 154.75 1.0
182 year    2020.00
LAT      -15.45
LON      139.37
tc         1.00
Name: 182, dtype: float64 2020.0 -15.45 139.37 1.0
183 year    2020.00
LAT      -14.98
LON      163.72
tc         1.00
Name: 183, dtype: float64 2020.0 -14.98 163.72 1.0
184 year    2020.00
LAT      -14.35
LON     -171.15
tc         1.00
Name: 184, dtype: float64 2020.0 -14.35 -171.15 1.0
185 year    2020.0
LAT      -14.3
LON      173.5
tc         1.0
Name: 185, dtype: float64 2020.0 -14.3 173.5 1.0
186 year    2020.00
LAT      -13.05
LON      127.15
tc         1.00
Name: 186, dtype: float64 2020.0 -13.05 127.15 1.0
187 year    2020.0
LAT      -12.4
LON      179.6
tc         1.0
Name: 187, dtype: float64 2020.0 -12.4 179.6 1.0
188 year    2020.00
LAT      -12.13
LON     -176.22
tc         1.00
Name: 188, dtype: float64 2020.0 -12.13 -176.22 1.0
189 year    2020.00
LAT      -11.95
LON      176.12
tc         1.00
Name: 189, dtype: float64 2020.0 -11.95 176.12 1.0
190 year    2020.00
LAT      -10.38
LON      159.54
tc         1.00
Name: 190, dtype: float64 2020.0 -10.38 159.54 1.0
191 year    2021.0
LAT      -23.0
LON      166.6
tc         1.0
Name: 191, dtype: float64 2021.0 -23.0 166.6 1.0
192 year    2021.00
LAT      -21.42
LON      181.30
tc         1.00
Name: 192, dtype: float64 2021.0 -21.42 181.3 1.0
193 year    2021.00
LAT      -17.15
LON      148.20
tc         1.00
Name: 193, dtype: float64 2021.0 -17.15 148.2 1.0
194 year    2021.00
LAT      -16.20
LON      139.15
tc         1.00
Name: 194, dtype: float64 2021.0 -16.2 139.15 1.0
195 year    2021.0
LAT      -15.5
LON      174.5
tc         1.0
Name: 195, dtype: float64 2021.0 -15.5 174.5 1.0
196 year    2021.00
LAT      -14.62
LON      146.40
tc         1.00
Name: 196, dtype: float64 2021.0 -14.62 146.4 1.0
197 year    2021.00
LAT      -14.18
LON      175.90
tc         1.00
Name: 197, dtype: float64 2021.0 -14.18 175.9 1.0
198 year    2021.00
LAT      -13.95
LON      152.35
tc         1.00
Name: 198, dtype: float64 2021.0 -13.95 152.35 1.0
199 year    2022.00
LAT      -20.10
LON      176.41
tc         1.00
Name: 199, dtype: float64 2022.0 -20.1 176.41 1.0

In [44]:
# 将 DataArray 对象保存到 nc 文件
#tc.to_netcdf("tc.nc")

In [27]:
# 按照年份进行分组，并计算SI每个年份的台风总数量
df1_total = df1_count.groupby('year')['tc'].sum().reset_index()

In [28]:
df1_total

    year  tc
0   2000  10
1   2001  18
2   2002  17
3   2003  19
4   2004  18
5   2005  16
6   2006  15
7   2007  18
8   2008  19
9   2009  18
10  2010  13
11  2011  14
12  2012  17
13  2013  18
14  2014  13
15  2015  16
16  2016   9
17  2017  11
18  2018  16
19  2019  17
20  2020  19
21  2021  14
22  2022   2

In [29]:
# 新建一个包含所有年份的 DataFrame（由于2000年前为0，我这里直接从2000年开始）
years = range(2000, 2023)
df1_total_result = pd.DataFrame({'year': years})
# 合并两个 DataFrame
df1_total_result = pd.merge(df1_total_result, df1_total, on='year', how='left')
# 将缺失值填充为 0
df1_total_result['tc'] = df1_total_result['tc'].fillna(0)
df1_total_result

    year  tc
0   2000  10
1   2001  18
2   2002  17
3   2003  19
4   2004  18
5   2005  16
6   2006  15
7   2007  18
8   2008  19
9   2009  18
10  2010  13
11  2011  14
12  2012  17
13  2013  18
14  2014  13
15  2015  16
16  2016   9
17  2017  11
18  2018  16
19  2019  17
20  2020  19
21  2021  14
22  2022   2

# 回归分析

In [30]:
SI_total = df1_total_result['tc'].values
SI_total

array([10, 18, 17, 19, 18, 16, 15, 18, 19, 18, 13, 14, 17, 18, 13, 16,  9,
       11, 16, 17, 19, 14,  2])

In [33]:
tc.shape

(23, 17, 144)

In [35]:
# 创建3个空数组存放回归系数和p值
slope = np.full((tc.shape[1], tc.shape[2]), np.nan)
r = np.full((tc.shape[1], tc.shape[2]), np.nan)
p_value = np.full((tc.shape[1], tc.shape[2]), np.nan)

# 循环每个格点计算回归系数和p值
for i in tqdm(range(17)):
    for j in range(144):
        # 计算多年数据相加结果
        total = tc[:,i,j].sum()
        # 仅当多年数据相加结果大于0时进行回归分析
        if total > 0:
            slope[i,j],_,r[i,j],p_value[i,j],_ = linregress(SI_total,tc[:,i,j])

100%|██████████| 17/17 [00:00<00:00, 20.10it/s]

In [20]:
#s = pd.DataFrame(slope)
#n1 = s.to_csv('slope.csv', index = False, header=False,na_rep='NaN')

In [39]:
p_value.max()

nan

In [36]:
np.nanmin(slope) #-0.05~0.05

-0.05019120458891013

# 画图

In [22]:
lon = tc.lon
lat = tc.lat

In [53]:
# 显著性打点设置为95%
area1 = np.where(p_value < 0.05)
nx,ny = np.meshgrid(lon,lat)

In [41]:
# 自定义色标
newcolors_1=[
       [0.14117647, 0.        , 0.84705882, 1.        ],
       [0.15686275, 0.34117647, 1.        , 1.        ],
       [0.23921569, 0.52941176, 1.        , 1.        ],
       [0.3372549 , 0.69019608, 1.        , 1.        ],
       [0.45882353, 0.82745098, 1.        , 1.        ],
       [0.6       , 0.91764706, 1.        , 1.        ],
       [1.        , 0.83921569, 0.6       , 1.        ],
       [1.        , 0.6745098 , 0.45882353, 1.        ],
       [1.        , 0.47058824, 0.3372549 , 1.        ],
       [1.        , 0.23921569, 0.23921569, 1.        ],
       [0.84705882, 0.08235294, 0.18431373, 1.        ],
       [0.64705882, 0.        , 0.12941176, 1.        ]
]
newcmap_1 = ListedColormap(newcolors_1[::1])
newcmap_1

In [58]:
# 设置字体
config = {
    "font.family": 'serif',
    "font.size": 12,
    "mathtext.fontset":'stix',
    'axes.unicode_minus': False 
         }
rcParams.update(config)

fig = plt.figure(figsize=(12,8))
proj = ccrs.PlateCarree(central_longitude=180)
leftlon, rightlon, lowerlat, upperlat = (10,240,-40,0)
img_extent = [leftlon, rightlon, lowerlat, upperlat]
lon_formatter = cticker.LongitudeFormatter()
lat_formatter = cticker.LatitudeFormatter()

ax = fig.add_axes([0.1, 0.1, 0.8, 0.6],projection = proj)
ax.set_extent(img_extent, crs=ccrs.PlateCarree())
land = cfeature.NaturalEarthFeature('physical','land','50m',edgecolor='face',facecolor=cfeature.COLORS['land'])
#ax.add_feature(land,facecolor='0.75')
ax.add_feature(cfeature.COASTLINE.with_scale('50m'))
ax.set_xticks(np.arange(leftlon,rightlon+20,20), crs=ccrs.PlateCarree())
ax.set_yticks(np.arange(lowerlat,upperlat+10,10), crs=ccrs.PlateCarree())
ax.xaxis.set_major_formatter(lon_formatter)
ax.yaxis.set_major_formatter(lat_formatter)
c1 = ax.pcolor(lon,lat, slope, zorder=0, vmin=-0.06, vmax=0.06, transform=ccrs.PlateCarree(), cmap=newcmap_1)
sig1 = ax.scatter(nx[area1], ny[area1],marker = '.',s=6, linewidths=1.3, c='purple',alpha=0.7,transform=ccrs.PlateCarree())

# colorbar
position=fig.add_axes([0.2, 0.22,  0.6, 0.025])
cmap_ticks = [-0.05, -0.04, -0.03, -0.02, -0.01, 0, 0.01, 0.02, 0.03, 0.04, 0.05]
fig.colorbar(c1,cax=position,ticks=cmap_ticks,orientation='horizontal',format='%.2f')

plt.savefig('TC生成频率.png', dpi=600, bbox_inches='tight',pad_inches = 0.2)
plt.show()